// © Copyright 2004-2010, 2015-2016 HP Development Company, L.P.

HSDTaskName = "Команды";

HSDDescriptionLabel = "Введите команды для выбранного принтера.";
HSDCommandLabel = "Команда:";
HSDGetResponseCheck = "Отображение ответа от устройства";
HSDLoadButton = "Загрузить команды…";
HSDSaveButton = "Сохранить команды…";
HSDStopReceivingButton = "Остановить прием";

HSDInstructionLabel = "Введите шестнадцатеричный код и текстовое описание нового специального символа.";
HSDHexLabel = "Шестнадцатеричный код:";
HSDDescLabel = "Описание:";
HSDHexTableColumn = "Шестнадцатеричный код";
HSDDescTableColumn = "Описание";
HSDCancelButton = "Отмена";
HSDOKButton = "OK";

ErrorSendTitle = "Не удается передать данные в принтер";
ErrorSendMsg = "Убедитесь в том, что принтер подсоединен и включен, затем повторите попытку.";

500 = "С этого экрана можно передавать устройству произвольные команды и получать любые данные, возвращаемые в результате работы команды.";
501 = "Команда";
502 = "Ответ";
503 = "Получить ответ";

HSDSendButtonTitle = "Передать";

SpecialsCharactersMenuItem = "Специальный символ";
AddSpecialCharacterMenuItem = "Добавление специального символа…";
EditSpecialCharactersMenuItem = "Редактировать специальные символы…";

SpecialCommand0 = "04 - PS конец файла ^D";
SpecialCommand1 = "0c - перевод страницы <FF>";
SpecialCommand2 = "0d - возврат каретки <CR>";
SpecialCommand3 = "1b - выход <ESC>";

NoSaveTitle = "Не удается сохранить файл";
NoSaveMsg = "Повторите попытку в новом местоположении.";
DidNotSaveMessage = "Убедитесь в наличии дискового пространства, достаточного для сохранения файла в указанном местоположении, и соответствующих полномочий доступа.";
NoLoadTitle = "Не удается открыть файл";
NoLoadMsg = "Убедитесь, что этот файл был сохранен в программе HP Utility.";


BigSizeAlertTitle = "Чрезмерный размер файла.";
BigSizeAlertMsg = "Модуль \"Команды\" поддерживает файлы размером до 1 Мбайт. Для загрузки файлов большего размера используйте модуль \"Загрузка файла\".";

HSDDoneButton = "Готово";
HSDEditSpecialsInstructionLabel = "Редактировать специальные символы";
"Special Character Description" = "Описание специального символа";
PrinterResponse = "Ответ принтера";
